app/Controllers/Auth.php

    public function auth()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('email');
        // $username = $this->request->getVar('email');
        // dd($email);
        $password = $this->request->getVar('password');
        $data = $model->where('user_email', $email)->orwhere('user_name', $email)->first();
---
SELECT *
FROM `users`
WHERE `user_email` = 'karyawan'
OR `user_name` = 'karyawan'
 LIMIT 1