app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $dataUser = $this->userModel->findAll();