app/Models/AcaraModel.php

    public function getId($id = false)
    {
        $query = $this->select('*');
        if ($id === false) {
            return $query->findAll();
---
SELECT *
FROM `tbl_acara`